# Taps
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"

# Binaries
brew "ffmpeg" # Play, record, convert, and stream audio and video
brew "ntfs-3g" # Read-write NTFS driver for FUSE
brew "zsh" # UNIX shell (command interpreter)
brew "wget" # Internet file retriever
brew 'git'
brew 'bash' # Latest Bash version
brew 'coreutils' # Those that come with macOS are outdated
brew 'grep'
brew "mas" # Mac App Store command-line interface
brew "zplug"
brew "glib" # Core application library for C

# Tools
brew "bash-completion" # Programmable completion for Bash 3.2
brew "jenv" # Manage your Java environment
brew "mp3wrap" # Wrap two or more mp3 files in a single large file
brew "pandoc" # Swiss-army knife of markup format conversion
brew "tree" # Display directories as trees (with optional color/HTML output)
brew "z" # Tracks most-used directories to make cd smarter
cask "openineditor-lite" # Finder Toolbar app to open the current directory in Editor
cask "openinterminal-lite" # Finder Toolbar app to open the current directory in Terminal
cask "iterm2"
cask "logitech-options"
cask "lunar"
cask "miktex-console"
cask "stay"
cask "transmission"
cask "vlc"
brew "mackup"
cask "anaconda"

# Development
brew "git" # Distributed revision control system
brew "node", link: false # Platform built on V8 to build network applications
brew "nvm" # Manage multiple Node.js versions
brew "v8" # Google's JavaScript engine
brew "openjdk" # Development kit for the Java programming language
brew "python@3.9" # Interpreted, interactive, object-oriented programming language

# Apps
mas "Amphetamine", id: 937984704
mas "BetterSnapTool", id: 417375580
#mas "LiquidText", id: 922765270
mas "pomodorome", id: 1484801884
cask "bettertouchtool"
cask "brave-browser"
cask "google-chrome" # Web browser
cask "google-drive-file-stream"
cask "microsoft-office"
cask "notion"
cask "obsidian"
cask "zotero"
cask "cakebrew" # GUI app for Homebrew
mas "The Unarchiver", id: 425424353

mas "Tasks", id: 1502903102
mas "TextSniper", id: 1528890965
mas "Todoist", id: 585829637
mas "Toggl Track", id: 957734279
cask "keepassxc" # Password manager app
cask "alfred"
cask "android-file-transfer"

cask "ferdi" # Messaging browser which combines several services
cask 'discord'
mas "Spark", id: 1176895641
cask 'signal'
cask 'zoom'

cask 'docker'
brew "docker-compose" # Isolated development environments using Docker
cask "ganache" # Personal blockchain for Ethereum development
brew "clojure/tools/clojure" # The Clojure Programming Language
brew "azure-cli" # Microsoft Azure CLI 2.0
cask 'figma'
cask "texstudio" # LaTeX editor
cask 'github'
cask 'visual-studio-code'
cask "arduino"
cask "atom"
cask "typora"
cask "intellij-idea" # Java IDE by JetBrains
cask "pycharm" # Python InteliJe IDE
mas "Xcode", id: 497799835

# Quick Look Plugins (https://github.com/sindresorhus/quick-look-plugins)
cask "qlcolorcode"
cask "qlstephen"
cask "qlmarkdown"
cask "quicklook-json"
cask "qlimagesize"
cask "suspicious-package"
cask "quicklookase"
cask "qlvideo"
